docs/audit/lint/phase3-start-diffs/src__hooks__gestionale__use-stock-adjust-mutation-legacy.ts.diff
diff --git a/src/hooks/gestionale/use-stock-adjust-mutation-legacy.ts b/src/hooks/gestionale/use-stock-adjust-mutation-legacy.ts
index e464f773..1fbc97a5 100644
--- a/src/hooks/gestionale/use-stock-adjust-mutation-legacy.ts
+++ b/src/hooks/gestionale/use-stock-adjust-mutation-legacy.ts
@@ -8,11 +8,9 @@
 import { useCallback, useRef } from "react";
 import { useMutation, useQueryClient } from "@tanstack/react-query";
 import { QK } from "@/src/lib/react-query/query-keys";
-import { stockAdjustFetch, type StockAdjustRequest, type StockAdjustResponse } from "@/lib/magazzino/stock-adjust-client";
 import {
   getStockEntity,
   mergeStockEntity,
-  type StockEntity,
 } from "@/lib/magazzino/stock-entity-cache";
 import { applyOptimisticStockAdjust } from "@/lib/magazzino/apply-optimistic-stock-adjust";
 import { markRecentLocalGestionaleMutation } from "@/lib/sync/recent-local-mutation";
